Revit 2027 API
WallPaint Class
 A static class that provides access to the property names that appear in the WallPaint visual asset schema.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.WallPaint
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class WallPaint
Public NotInheritable Class WallPaint
public ref class WallPaint abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallPaint = class end
The WallPaint type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "WallPaint" schema.
CommonTintToggle |  The property labeled "Tint" from the "WallPaint" schema.
WallpaintApplication |  The property labeled "Application" from the "WallPaint" schema.
WallpaintColor |  The property labeled "Color" from the "WallPaint" schema.
WallpaintFinish |  The property labeled "Finish" from the "WallPaint" schema.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace